---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.CreateEnumeration(System.String)
source: html/4252596c-01e6-623e-e77e-c743072549b6.htm
---
# Autodesk.Revit.DB.IFC.IFCData.CreateEnumeration Method

Creates a enum data object.

## Syntax (C#)
```csharp
public static IFCData CreateEnumeration(
	string value
)
```

## Parameters
- **value** (`System.String`) - The string value.

## Returns
The IFCData object.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null